src/cf/Catalogs/инт_Подписчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_Подписчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодписчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыПодписчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах.(0 - сообщение будет обработано повторно как можно быстрее)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостПроцессинг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСостояния</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/инт_Подписчики/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////

// инт_Подписчики

//  

////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Сформировать сообщение по подписчику
//
// Параметры:
//  ДанныеСообщения     -   Соответствие   - Соттветствие содержащее данные для сериатизации
//  Подписчик         -  СпраочникСсылка.инт_Подписчики    - ссылка на подписчика.
// 
// Возвращаемое значение:
//  Строка - Сериализованное, котовое к отправке подписчику сообщение
//
Функция СформироватьСообщениеПоПодписчику(ДанныеСообщения, Подписчик) Экспорт
    // По типу подписчика определяется обработчик сообщения. Может быть, если добавим jsonrpc например, будем сразу там паковать имя потока и тд...
    ОбработчикСобытий = инт_ОтправкаИсходящихСообщенийПовтИсп.ОбщийМодульОбработкиСообщенийПоТипуПодписчика(Подписчик.ТипПодписчика);
    
    Возврат ОбработчикСобытий.СформироватьСообщениеПоПодписчику(ДанныеСообщения, Подписчик);
КонецФункции

// Процедура - Отправить сообщение подписчику
//
// Параметры:
//  Сообщение     - Структура - Данные сообщения 
//
Процедура ОтправитьСообщение(Сообщение) Экспорт
    Подписчик = Сообщение.Подписчик;
    ОбработчикСобытий = инт_ОтправкаИсходящихСообщенийПовтИсп.ОбщийМодульОбработкиСообщенийПоТипуПодписчика(Подписчик.ТипПодписчика);
    ОбработчикСобытий.ОтправитьСообщение(Сообщение);

КонецПроцедуры

// Процедура - Расчитать дату следующей попытки по дате
//
// Параметры:
//  ДатаНачальная         -   Дата   - Дата от которой будет Отсчитываться пауза
//  Подписчик     - СправочникСсылка.инт_Подписчики - подписчик для которого будет делаться расчет
//
Функция РасчитатьДатуСледующейПопыткиПоДате(ДатаНачальная, Подписчик) Экспорт
   Возврат Дата(ДатаНачальная+Подписчик.ПаузаМеждуПопыткамиОбработки);
КонецФункции

// Процедура - Выполнить пост обработку
//
// Параметры:
//  Ответ			 - ПодготовленныйОтвет	 - См. инт_КоннекторHTTP.ВызватьМетод
//  ИсходныеДанные	 - ОпределяемыйТип.инт_ИсходныеДанные	 - Ссылка на исходные данные сообщения.
//
Процедура ВыполнитьПостОбработку(Подписчик, Ответ, ИсходныеДанные=Неопределено) Экспорт

	Код = ПолучитьОбработчикПоКодуСостояния(Ответ.КодСостояния, Подписчик);

	Попытка
        Исполнить(Код, Ответ, ИсходныеДанные, Истина);
    Исключение
        СообщениеОбОшибке = СтрШаблон("При пост-обработке ответа возникла ошибка!
        |
        | Информация об ошибке: %2",
        ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.Подписчики.ПостОбработкаОтвета",
                                    УровеньЖурналаРегистрации.Ошибка,
                                    ,
                                    ,
                                    СообщениеОбОшибке);
        ВызватьИсключение;
    КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьОбработчикПоКодуСостояния(КодСостояния, Подписчик)
	Обработчик = "";
	Подписчик = Справочники.инт_Подписчики.СоздатьЭлемент();
	ПостПроцессинг = Подписчик.ПостПроцессинг;
	СтрокаПостПроцессинга = ПостПроцессинг.Найти(КодСостояния, "КодСостояния");
	
	Если Не СтрокаПостПроцессинга = Неопределено Тогда
		Обработчик = СтрокаПостПроцессинга.Обработчик;
	Иначе
		Обработчик = ПолучитьОбработчикПоУмолчанию(КодСостояния);
	КонецЕсли;
	
	Возврат Обработчик;
КонецФункции

Функция ПолучитьОбработчикПоУмолчанию(КодСостояния)
	Обработчик = "";
	// Здесь через ИНачеЕсли можно определить базовое поведение для разных кодов состояний. Если их будет много - вынести в регистр
	Если Не (КодСостояния >= 200 И КодСостояния < 300) Тогда
		Обработчик = "СообщениеОбОшибке = СтрШаблон(""При попытке отправки сообщения код ответа отличается от ожидаемого!
			|	|Код состояния: %1
			|	|ТелоОтвета: %2"", Ответ.КодСостояния, ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело));
	    	|ВызватьИсключение Строка(Ответ.Тело);";
	КонецЕсли;
	Возврат Обработчик;
КонецФункции

Процедура Исполнить(Код, Ответ, ИсходныеДанные, РазрешитьФиксациюИзменений = Ложь)
    
    Результат = Новый Соответствие;
    
    УстановитьБезопасныйРежим(Истина);
    НачатьТранзакцию();
    Попытка
        // BSLLS:ExecuteExternalCodeInCommonModule-off
        Выполнить(Код);
        // BSLLS:ExecuteExternalCodeInCommonModule-on
        Если РазрешитьФиксациюИзменений Тогда
            ЗафиксироватьТранзакцию();
        Иначе
           //Для исходящих потоков или проверок фиксация изменений не нужна. 
           ОтменитьТранзакцию();
        КонецЕсли;
        
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
    УстановитьБезопасныйРежим(Ложь);
        
КонецПроцедуры

#КонецОбласти

#КонецЕсли
